app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "testing"], ["title", ""], ["url", ""], ["created_at", "2015-02-04 03:36:41.587533"], ["updated_at", "2015-02-04 03:36:41.587533"]]
---
  def create
    # make a new picture with what picture_params returns (which is a method we're calling)
    @picture = Picture.new(picture_params)
    if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "pictures" SET "artist" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["artist", "unknown"], ["updated_at", "2015-02-04 21:08:25.918349"], ["id", 5]]
---
  def update
    @picture = Picture.find(params[:id])

    if @picture.update_attributes(picture_params)